---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExceededAngleFlexToleranceWarning
source: html/081d9e72-73d3-5853-81d0-da1427bd9b1d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartExceededAngleFlexToleranceWarning Property

The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartExceededAngleFlexToleranceWarning { get; }
```